wisteria-1c/Конфигурация/InformationRegisters/СтатусыПубликацииТоваровЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПубликацииТоваровЯндексМаркет</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВыгрузкиТоваровЯндексМаркет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТовараПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТовараПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКатегорииПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеМоделиПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГиперссылкаНаРекомендованныеТовар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЦена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркерСтатуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьИдентификаторПлощадки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиЦены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокВУпаковках</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКатегорииМаркетплейса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКатегорииМаркетплейса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗаписьМаркетплейса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УсловиеПредоставленияСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияПредоставленияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/СтатусыВыгрузкиТоваровЯндексМаркет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыВыгрузкиТоваровЯндексМаркет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученаРекомендация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПриПолученииРекомендации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РекомендацияНеНайдена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденаРекомендация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаМодерации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПриОтправкеНаМодерацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодерацияПройдена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодерацияНеПройдена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НевернаяРекомендация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетМодерации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеНового</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВАрхиве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженСОшибками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СтатусыПубликацииТоваровЯндексМаркет/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено( Запись.Статус ) Тогда

		Элементы.ИдентификаторПубликации.Видимость = Ложь;
		Элементы.Номенклатура.ТолькоПросмотр = Ложь;
		Элементы.Характеристика.ТолькоПросмотр = Ложь;
		
	Иначе

		Элементы.ИдентификаторПубликации.Видимость = Истина;
		Элементы.Номенклатура.ТолькоПросмотр = Истина;
		Элементы.Характеристика.ТолькоПросмотр = Истина;
		
	КонецЕсли;

	ИнициализироватьСтраницы();
	ОбновитьПредставлениеТовара();
	
	БаннерДобавитьИПоказать();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить( "ПриЗакрытии", ИмяФормы, ЭтотОбъект );
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда, НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ОбновитьПредставлениеТовара();
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	
	ОбновитьПредставлениеТовара();
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНаРекомендованныеТоварОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Запись.ГиперссылкаНаРекомендованныеТовар) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку( Запись.ГиперссылкаНаРекомендованныеТовар );
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Заполните поле ""Гиперссылка на пример товара""'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандыДанныеТовара(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандыДанныеТовараПродолжение", ЭтотОбъект);
	СписокДоступныхКоманд = Новый СписокЗначений;
	СписокДоступныхКоманд.Добавить( "ОбновитьПредставлениеТовара", НСтр( "ru = 'Заполнить свойства из номенклатуры'" ) );
	ПоказатьВыборИзМеню( ОписаниеОповещения, СписокДоступныхКоманд, ТекущийЭлемент );
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОбновитьПредставлениеТовара(Команда)
	ОбновитьПредставлениеТовара();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаМодерацию(Команда)  
	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Запись.Номенклатура) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Заполните поле Номенклатура'"),,
		,,
		Отказ);	
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ОтправитьНаМодерациюНаСервере();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьСтраницы()
	
	Элементы.СтраницаДанныеСвязи.ТолькоПросмотр = Ложь;
	Элементы.СтраницаДанныеТовара.ТолькоПросмотр = Ложь;
	Элементы.СтраницаОписаниеОшибки.Видимость = Ложь;
	
	Если Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.НаМодерации
		ИЛИ  Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.МодерацияПройдена
		ИЛИ  Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.УтвержденаРекомендация Тогда
		
		Элементы.СтраницаДанныеСвязи.ТолькоПросмотр = Истина;
		Элементы.ОтправитьНаМодерацию.Видимость = Ложь;
		
	ИначеЕсли Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.ПолученаРекомендация Тогда
		Элементы.ОтправитьНаМодерацию.Видимость = Ложь;
	Иначе
		Элементы.ОтправитьНаМодерацию.Видимость = Истина;
	КонецЕсли;
	
	Если Запись.МаркерСтатуса = 0 И НЕ Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.ПустаяСсылка() Тогда // красный
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОписаниеОшибки;
		Элементы.СтраницаОписаниеОшибки.Видимость = Истина;
		
	ИначеЕсли Запись.МаркерСтатуса = 1 Тогда // желтый
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДанныеСвязи;
		
	ИначеЕсли Запись.МаркерСтатуса = 2 Тогда // серый
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДанныеТовара;
		
	ИначеЕсли Запись.МаркерСтатуса = 3 ИЛИ Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.ПустаяСсылка() Тогда // зеленый
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДанныеТовара;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаМодерациюНаСервере()
	
	Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.СозданиеНового;
	
	Если ПустаяСтрока( Запись.НаименованиеТовараПлощадки ) Тогда
		Запись.НаименованиеТовараПлощадки = Запись.ПредставлениеТовара;
	КонецЕсли;
	Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеТовара()
	
	Если Не ЗначениеЗаполнено( Запись.Номенклатура ) Тогда
		Возврат;
	КонецЕсли;
	
	ХарактеристикаСтрока = ?( ЗначениеЗаполнено( Запись.Характеристика ), ", " + Запись.Характеристика, "" );
	
	КатегорииНоменклатурыЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
	Запись.Номенклатура, "КатегорияНоменклатуры" );
	
	Запись.ПредставлениеТовара = "" + Запись.Номенклатура + ХарактеристикаСтрока;
	Запись.КатегорияНоменклатуры = КатегорииНоменклатурыЗначение;
	
	ОбновитьДопИнфо();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДопИнфо()
	
	Если Запись.КатегорияНоменклатуры <> "" Тогда 		
		ШаблонСообщения = НСтр("ru = 'Категория: %1'") + Символы.ПС;
		КатегорияНоменклатуры = СтрШаблон(ШаблонСообщения, Запись.КатегорияНоменклатуры);
	Иначе	
		КатегорияНоменклатуры  = НСтр("ru = 'Категория: не указана'") + Символы.ПС;
	КонецЕсли;
	
	НоменклатураЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта( Запись.Номенклатура, 
	"Артикул, Производитель, СтранаПроисхождения" );
	
	Если НоменклатураЗначенияРеквизитов.Артикул <> "" Тогда 
		ШаблонСообщения = НСтр("ru = 'Артикул: %1'") + Символы.ПС;
		Артикул = СтрШаблон(ШаблонСообщения, НоменклатураЗначенияРеквизитов.Артикул);
	Иначе	
		Артикул  = НСтр("ru = 'Артикул: не указан'") + Символы.ПС;
	КонецЕсли;
	
	Если НоменклатураЗначенияРеквизитов.Производитель <> Справочники.Контрагенты.ПустаяСсылка() Тогда 
		ШаблонСообщения = НСтр("ru = 'Производитель: %1'") + Символы.ПС;
		Производитель = СтрШаблон(ШаблонСообщения, НоменклатураЗначенияРеквизитов.Производитель);					
	Иначе	
		Производитель  = НСтр("ru = 'Производитель: не указан'") + Символы.ПС;
	КонецЕсли;
	
	Если НоменклатураЗначенияРеквизитов.СтранаПроисхождения <> Справочники.СтраныМира.ПустаяСсылка() Тогда 		
		ШаблонСообщения = НСтр("ru = 'Страна происхождения: %1'") + Символы.ПС;
		Страна = СтрШаблон(ШаблонСообщения, НоменклатураЗначенияРеквизитов.СтранаПроисхождения);		
	Иначе	
		Страна  = НСтр("ru = 'Страна происхождения: не указана'") + Символы.ПС;
	КонецЕсли;
	
	ЕстьШтрихКоды = ПолучитьШтрихКоды().Количество()>0; 
	
	Если  ЕстьШтрихКоды Тогда
		ШтрихКоды  = НСтр("ru = 'Штрих-коды: указаны'") + Символы.ПС;
	Иначе
		ШтрихКоды  = НСтр("ru = 'Штрих-коды: не указаны'") + Символы.ПС;
	КонецЕсли;
	
	ДанныеВесогабаритов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Номенклатура,
	"Вес,Высота,Длина,Ширина");
	
	Весогабариты =  ИнтеграцияСЯндексМаркетСервер.ПолучитьВесогабариты(ДанныеВесогабаритов.Вес,
	ДанныеВесогабаритов.Высота,
	ДанныеВесогабаритов.Длина,
	ДанныеВесогабаритов.Ширина
	);
	
	ВесогабаритыЗаголовок = НСтр("ru = 'Весогабариты:'") + Символы.ПС;
	
	Если Весогабариты.length <>"" Тогда   
		ШаблонСообщения = "	" + НСтр("ru = 'Длина: %1 см'") + Символы.ПС;
		ВесогабаритыДлина = СтрШаблон(ШаблонСообщения, Число(Весогабариты.length));		
	Иначе
		ВесогабаритыДлина = НСтр("ru = '	Длина: не указана'") + Символы.ПС;
	КонецЕсли;  
	
	Если Весогабариты.width <>"" Тогда  
		ШаблонСообщения = "	" + НСтр("ru = 'Ширина: %1 см'") + Символы.ПС;
		ВесогабаритыШирина = СтрШаблон(ШаблонСообщения, Число(Весогабариты.width));	
	Иначе
		ВесогабаритыШирина = "	" + НСтр("ru = 'Ширина: не указана'") + Символы.ПС;
	КонецЕсли; 
	
	Если Весогабариты.height <>"" Тогда    
		ШаблонСообщения = "	" + НСтр("ru = 'Высота: %1 см'") + Символы.ПС;
		ВесогабаритыВысота = СтрШаблон(ШаблонСообщения, Число(Весогабариты.height));	
	Иначе
		ВесогабаритыВысота = "	" + НСтр("ru = 'Высота: не указана'") + Символы.ПС;
	КонецЕсли; 
	
	Если Весогабариты.weight <>"" Тогда   
		ШаблонСообщения = "	" + НСтр("ru = 'Вес: %1 кг'") + Символы.ПС;
		ВесогабаритыВес = СтрШаблон(ШаблонСообщения, Число(Весогабариты.weight));	
	Иначе
		ВесогабаритыВес = "	" + НСтр("ru = 'Вес: не указан'") + Символы.ПС;
	КонецЕсли;  
	
	ДопИнфо = КатегорияНоменклатуры + Артикул 
	+ Производитель + Страна + ШтрихКоды + ВесогабаритыЗаголовок
	+ ВесогабаритыДлина + ВесогабаритыШирина + ВесогабаритыВысота + ВесогабаритыВес;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьШтрихКоды()
	
	Запрос = Новый Запрос ();
	Запрос.Параметры.Вставить("Номенклатура",Запись.Номенклатура);
	Запрос.Параметры.Вставить("Характеристика",Запись.Характеристика);
	Запрос.Текст = "ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	|	И ШтрихкодыНоменклатуры.Характеристика = &Характеристика";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ШтрихКоды = Новый Массив;
	
	Если Результат.Количество()>0 Тогда
		ШтрихКоды = Результат.ВыгрузитьКолонку("Штрихкод");
	КонецЕсли;	
	
	Возврат ШтрихКоды;
КонецФункции

&НаКлиенте
Процедура КомандыДанныеТовараПродолжение( ВыбранныйЭлемент, ДополнительныеПараметры ) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "ОбновитьПредставлениеТовара"  Тогда
		ОбновитьПредставлениеТовара();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция БаннерДобавитьИПоказать()
	
	Если Не ЗначениеЗаполнено( Запись.Статус ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.Скрываемый = Ложь;
	
	Если Запись.МаркерСтатуса = 0 Тогда
		ПараметрыВажногоСообщения.ТипСообщения = "Ошибка";
	ИначеЕсли Запись.МаркерСтатуса = 1 Тогда
		ПараметрыВажногоСообщения.ТипСообщения = "Предупреждение";
	ИначеЕсли Запись.МаркерСтатуса = 2 Тогда
		ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ИначеЕсли Запись.МаркерСтатуса = 3 Тогда 
		ПараметрыВажногоСообщения.ТипСообщения = "Успех";
	Иначе
		ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	КонецЕсли;
	
	ПараметрыВажногоСообщения.Сообщение = Строка( Запись.Статус );
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр( "ru = 'Статус.'" );
	
	ОбщегоНазначения.ДобавитьВажноеСообщение( ЭтотОбъект, ПараметрыВажногоСообщения );
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму( ЭтотОбъект );
	
	Возврат Истина;
КонецФункции

#КонецОбласти
